Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro_secure/src/packs/PIC32CM5112SG00100_DFP/component/tcc.h
/* DITH5 mode */
#define TCC_PER_DITH5_DITHER_Pos              _UINT32_(0)                                          /* (TCC_PER) Dithering Cycle Number Position */
#define TCC_PER_DITH5_DITHER_Msk              (_UINT32_(0x1F) << TCC_PER_DITH5_DITHER_Pos)         /* (TCC_PER) Dithering Cycle Number Mask */
#define TCC_PER_DITH5_DITHER(value)           (TCC_PER_DITH5_DITHER_Msk & (_UINT32_(value) << TCC_PER_DITH5_DITHER_Pos))
#define TCC_PER_DITH5_PER_Pos                 _UINT32_(5)                                          /* (TCC_PER) Period Value Position */
#define TCC_PER_DITH5_PER_Msk                 (_UINT32_(0x7FF) << TCC_PER_DITH5_PER_Pos)           /* (TCC_PER) Period Value Mask */
#define TCC_PER_DITH5_PER(value)              (TCC_PER_DITH5_PER_Msk & (_UINT32_(value) << TCC_PER_DITH5_PER_Pos))
#define TCC_PER_DITH5_Msk                     _UINT32_(0x0000FFFF)                                 /* (TCC_PER_DITH5) Register Mask  */

/* DITH6 mode */
#define TCC_PER_DITH6_DITHER_Pos              _UINT32_(0)                                          /* (TCC_PER) Dithering Cycle Number Position */
#define TCC_PER_DITH6_DITHER_Msk              (_UINT32_(0x3F) << TCC_PER_DITH6_DITHER_Pos)         /* (TCC_PER) Dithering Cycle Number Mask */
#define TCC_PER_DITH6_DITHER(value)           (TCC_PER_DITH6_DITHER_Msk & (_UINT32_(value) << TCC_PER_DITH6_DITHER_Pos))
#define TCC_PER_DITH6_PER_Pos                 _UINT32_(6)                                          /* (TCC_PER) Period Value Position */
#define TCC_PER_DITH6_PER_Msk                 (_UINT32_(0x3FF) << TCC_PER_DITH6_PER_Pos)           /* (TCC_PER) Period Value Mask */
#define TCC_PER_DITH6_PER(value)              (TCC_PER_DITH6_PER_Msk & (_UINT32_(value) << TCC_PER_DITH6_PER_Pos))
#define TCC_PER_DITH6_Msk                     _UINT32_(0x0000FFFF)                                 /* (TCC_PER_DITH6) Register Mask  */


/* -------- TCC_CC : (TCC Offset: 0x44) (R/W 32) Compare and Capture -------- */
#define TCC_CC_RESETVALUE                     _UINT32_(0x00)                                       /*  (TCC_CC) Compare and Capture  Reset Value */

#define TCC_CC_CC_Pos                         _UINT32_(0)                                          /* (TCC_CC) Channel Compare/Capture Value Position */
#define TCC_CC_CC_Msk                         (_UINT32_(0xFFFF) << TCC_CC_CC_Pos)                  /* (TCC_CC) Channel Compare/Capture Value Mask */
#define TCC_CC_CC(value)                      (TCC_CC_CC_Msk & (_UINT32_(value) << TCC_CC_CC_Pos)) /* Assignment of value for CC in the TCC_CC register */
#define TCC_CC_Msk                            _UINT32_(0x0000FFFF)                                 /* (TCC_CC) Register Mask  */

/* DITH4 mode */
#define TCC_CC_DITH4_DITHER_Pos               _UINT32_(0)                                          /* (TCC_CC) Dithering Cycle Number Position */
#define TCC_CC_DITH4_DITHER_Msk               (_UINT32_(0xF) << TCC_CC_DITH4_DITHER_Pos)           /* (TCC_CC) Dithering Cycle Number Mask */
#define TCC_CC_DITH4_DITHER(value)            (TCC_CC_DITH4_DITHER_Msk & (_UINT32_(value) << TCC_CC_DITH4_DITHER_Pos))
#define TCC_CC_DITH4_CC_Pos                   _UINT32_(4)                                          /* (TCC_CC) Channel Compare/Capture Value Position */
#define TCC_CC_DITH4_CC_Msk                   (_UINT32_(0xFFF) << TCC_CC_DITH4_CC_Pos)             /* (TCC_CC) Channel Compare/Capture Value Mask */
#define TCC_CC_DITH4_CC(value)                (TCC_CC_DITH4_CC_Msk & (_UINT32_(value) << TCC_CC_DITH4_CC_Pos))
#define TCC_CC_DITH4_Msk                      _UINT32_(0x0000FFFF)                                 /* (TCC_CC_DITH4) Register Mask  */

/* DITH5 mode */
#define TCC_CC_DITH5_DITHER_Pos               _UINT32_(0)                                          /* (TCC_CC) Dithering Cycle Number Position */
#define TCC_CC_DITH5_DITHER_Msk               (_UINT32_(0x1F) << TCC_CC_DITH5_DITHER_Pos)          /* (TCC_CC) Dithering Cycle Number Mask */
#define TCC_CC_DITH5_DITHER(value)            (TCC_CC_DITH5_DITHER_Msk & (_UINT32_(value) << TCC_CC_DITH5_DITHER_Pos))
#define TCC_CC_DITH5_CC_Pos                   _UINT32_(5)                                          /* (TCC_CC) Channel Compare/Capture Value Position */
#define TCC_CC_DITH5_CC_Msk                   (_UINT32_(0x7FF) << TCC_CC_DITH5_CC_Pos)             /* (TCC_CC) Channel Compare/Capture Value Mask */
#define TCC_CC_DITH5_CC(value)                (TCC_CC_DITH5_CC_Msk & (_UINT32_(value) << TCC_CC_DITH5_CC_Pos))
#define TCC_CC_DITH5_Msk                      _UINT32_(0x0000FFFF)                                 /* (TCC_CC_DITH5) Register Mask  */

/* DITH6 mode */
#define TCC_CC_DITH6_DITHER_Pos               _UINT32_(0)                                          /* (TCC_CC) Dithering Cycle Number Position */
#define TCC_CC_DITH6_DITHER_Msk               (_UINT32_(0x3F) << TCC_CC_DITH6_DITHER_Pos)          /* (TCC_CC) Dithering Cycle Number Mask */
#define TCC_CC_DITH6_DITHER(value)            (TCC_CC_DITH6_DITHER_Msk & (_UINT32_(value) << TCC_CC_DITH6_DITHER_Pos))
#define TCC_CC_DITH6_CC_Pos                   _UINT32_(6)                                          /* (TCC_CC) Channel Compare/Capture Value Position */
#define TCC_CC_DITH6_CC_Msk                   (_UINT32_(0x3FF) << TCC_CC_DITH6_CC_Pos)             /* (TCC_CC) Channel Compare/Capture Value Mask */
#define TCC_CC_DITH6_CC(value)                (TCC_CC_DITH6_CC_Msk & (_UINT32_(value) << TCC_CC_DITH6_CC_Pos))
#define TCC_CC_DITH6_Msk                      _UINT32_(0x0000FFFF)                                 /* (TCC_CC_DITH6) Register Mask  */


/* -------- TCC_PERBUF : (TCC Offset: 0x6C) (R/W 32) Period Buffer -------- */
#define TCC_PERBUF_RESETVALUE                 _UINT32_(0xFFFF)                                     /*  (TCC_PERBUF) Period Buffer  Reset Value */

#define TCC_PERBUF_PERBUF_Pos                 _UINT32_(0)                                          /* (TCC_PERBUF) Period Buffer Value Position */
#define TCC_PERBUF_PERBUF_Msk                 (_UINT32_(0xFFFF) << TCC_PERBUF_PERBUF_Pos)          /* (TCC_PERBUF) Period Buffer Value Mask */
#define TCC_PERBUF_PERBUF(value)              (TCC_PERBUF_PERBUF_Msk & (_UINT32_(value) << TCC_PERBUF_PERBUF_Pos)) /* Assignment of value for PERBUF in the TCC_PERBUF register */
#define TCC_PERBUF_Msk                        _UINT32_(0x0000FFFF)                                 /* (TCC_PERBUF) Register Mask  */

/* DITH4 mode */
#define TCC_PERBUF_DITH4_DITHERBUF_Pos        _UINT32_(0)                                          /* (TCC_PERBUF) Dithering Buffer Cycle Number Position */
#define TCC_PERBUF_DITH4_DITHERBUF_Msk        (_UINT32_(0xF) << TCC_PERBUF_DITH4_DITHERBUF_Pos)    /* (TCC_PERBUF) Dithering Buffer Cycle Number Mask */
#define TCC_PERBUF_DITH4_DITHERBUF(value)     (TCC_PERBUF_DITH4_DITHERBUF_Msk & (_UINT32_(value) << TCC_PERBUF_DITH4_DITHERBUF_Pos))
#define TCC_PERBUF_DITH4_PERBUF_Pos           _UINT32_(4)                                          /* (TCC_PERBUF) Period Buffer Value Position */
#define TCC_PERBUF_DITH4_PERBUF_Msk           (_UINT32_(0xFFF) << TCC_PERBUF_DITH4_PERBUF_Pos)     /* (TCC_PERBUF) Period Buffer Value Mask */
#define TCC_PERBUF_DITH4_PERBUF(value)        (TCC_PERBUF_DITH4_PERBUF_Msk & (_UINT32_(value) << TCC_PERBUF_DITH4_PERBUF_Pos))
#define TCC_PERBUF_DITH4_Msk                  _UINT32_(0x0000FFFF)                                 /* (TCC_PERBUF_DITH4) Register Mask  */

